app/controllers/items_controller.rb

  def show
    @item = Item.find(params[:id])
---
SELECT * FROM "items" WHERE ("items"."id" = 1)

  def edit
    @item = Item.find(params[:id])
---
SELECT * FROM "items" WHERE ("items"."id" = 1)

  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("created_at", "guid", "updated_at", "deleted", "version", "content") VALUES('2009-01-27 20:44:42', 'B', '2009-01-27 20:44:42', 'f', NULL, 'h1. contact:Jean-Marc_VINCENT

  def update
    @item = Item.find(params[:id])

    respond_to do |format|
      if @item.update_attributes(params[:item])
---
SELECT * FROM "items" WHERE ("items"."id" = 1)
UPDATE "items" SET "updated_at" = '2009-01-28 23:42:09', "version" = 3, "content" = 'Encore un deux' WHERE "id" = 12

  def destroy
    @item = Item.find(params[:id])
    @item.destroy
---
SELECT * FROM "items" WHERE ("items"."id" = 7)
DELETE FROM "items" WHERE "id" = 7